<h1>Условия  - Практическая 3</h1>
<h3>Задача 1</h3>
<?php
$a = 4;
$b = 5;
$d = $a+$b;
$e = $a*$b;
if($a < $b ){
    echo "a= $a, b=$b, res=$d";
}
else{
    echo "a= $a, b=$b, res=$e";
}
?>
<h3>Задача 2</h3>
<?php
$a = 80;
$b = 0;
if ($a+$b<180 && $a>0 && $b>0 && ($a=90 || $b=90)) {
    echo "a= $a, b=$b, Существует такой треугольник и он прямоугольный";
} elseif ($a+$b<180 and !($a=90 or $b=90)) {
    echo 'Существует такой треугольник, но он НЕ прямоугольный';
} else {
    echo "a= $a, b=$b, Нет такого треугольника";
}
?>
<h3>Задача 3</h3>
<?php
$age = 3;
$ageGroup ='';
if ($age <= 1) {
    $ageGroup='Котята';
} elseif ($age>1 && $age<=3) {
    $ageGroup='Молодые коты';
} elseif ($age>3 && $age<=7) {
    $ageGroup='Коты средних лет';
} else {
    $ageGroup='Почтенные коты';
}
echo "age= $age, $ageGroup";
?>
<h3>Задача 4</h3>
<?php
$a = 4;
$b = 5;
$c = 4;
$d = $a+$b;
$f = $a+$c;
$s = $b+$c;
if ($d>$c || $f>$b || $s>$a) {
    echo "a= $a, b=$b, c=$c,Существует такой треугольник";
} else {
    echo 'НЕ существует такой треугольник';
}
?>
<h3>Задача 5</h3>
<?php
$n = 2026;
if($n%100!=0 && $n%4==0){
    echo "n= $n, Год високосный";
}
elseif ($n%400==0){
    echo "n= $n, Год високосный";
} else{
    echo 'Год НЕ високосный';
}
?>
<h3>Задача 6</h3>
<?php
$a = 32767;
$b = -1;
$sum = $a+$b;
if($sum>32767){
    echo 'Результат привел к переполнению';
}
else{
    echo 'Результат НЕ привел к переполнению ';
    echo "a+b=$sum";
}
?>
<h3>Задача 7</h3>
<?php
$a = 2;
$b = 2;
$x = 2;
$y = 3;
$z = 3;
if(($a>=$x && $b>=$y)||($a>=$x && $b>=$z)||($a>=$y && $b>=$z)||($a>=$y && $b>=$x)||($a>=$z && $b>=$x)||($a>=$z && $b>=$y)){
    echo 'Кирпич пройдет через отверстие';
}
else{
    echo 'Кирпич не пройдет через отвертсие';
}
?>
<h3>Задача 8</h3>
<?php
$n = 2;
if('ПОКА НЕ ЗНАЮ НАДО ПОДУМАТЬ'){
    echo 'Кирпич пройдет через отверстие';
}
else{
    echo 'Кирпич не пройдет через отвертсие';
}
?>
<h3>Задача 9</h3>
<?php
$n = 24;
if($n%4==0 && $n%6==0){
    echo 'Число делится на 4 и 6';
}
else{
    echo 'Число НЕ делится на 4 и 6';
}
?>
<h3>Задача 10</h3>
<?php
$x = 5;
$y = -6;
$r = 8;
if($x**2+$y**2<=$r**2){
    echo 'Данная точка лежит внутри круга';
}
else{
    echo 'Данная точка НЕ лежит внутри круга';
}
?>
