<h1>Практическая работа - Оператор выборв</h1>
<h2>Задача 1</h2>
<form actions="">
    <p>Введите цифру (0-9):</p>
    <input name="number">
    <input type="submit" value="Отправить">
</form>
<?php
if(isset($_GET['number'])){
    $n = $_GET['number'];
    $res = match((int)$n){
        0 => '0 - zero',
        1 => '1 - one',
        2 => '2 - two',
        3 => '3 - three',
        4 => '4 - four',
        5 => '5 - five',
        6 => '6 - six',
        7 => '7 - seven',
        8 => '8 - eight',
        9 => '9 - nine',
    };
    echo $res;
} else {
    echo 'Данные не получены';
}
?>
<h2>Задача 2</h2>
<form actions="">
    <p>Введите номер месяца</p>
    <input name="number2">
    <input type="submit" value="Отправить">
</form>
<?php
if(isset($_GET['number2'])){
    $n = $_GET['number2'];
    $res = match((int)$n){
        1 => '1 января — Новый год, 7 января — Рождество',
        2 => '14 февраля - День Святого Валентина, 23 февраля — День защитника Отечества',
        3 => '8 марта - Международный женский день',
        4 => '1 апреля - День смеха, 4 апреля - Лазарева суббота',
        5 => '1 мая — Праздник Весны и Труда, 9 мая - День Победы',
        6 => '12 июня -День России, 22 июня — День памяти и скорби',
        7 => '8 июля - День семьи, любви и верности',
        8 => '2 августа - День Воздушно-десантных войск',
        9 => '1 сентября - День знаний',
        10 => '5 октября - День учителя, 28 октября — День бабушек и дедушек',
        11 => '4 ноября — День народного единства, 22 ноября — День психолога',
        12 => '1 декабря — День математика, 4 декабря — День информатики',
    };
    echo $res;
} else {
    echo 'Данные не получены';
}
?>
<h2>Задача 3</h2>
<form actions="">
    <p>Введите число:</p>
    <input name="number3">
    <input type="submit" value="Отправить">
</form>
<?php
if(isset($_GET['number3'])){
    $n = $_GET['number3'];
    $res = match((int)$n){
        0 => 'Последняя цифра квадрата - 0',
        1 => 'Последняя цифра квадрата - 1',
        2 => 'Последняя цифра квадрата - 4',
        3 => 'Последняя цифра квадрата - 9',
        4 => 'Последняя цифра квадрата - 6',
        5 => 'Последняя цифра квадрата - 5',
        6 => 'Последняя цифра квадрата - 6',
        7 => 'Последняя цифра квадрата - 9',
        8 => 'Последняя цифра квадрата - 4',
        9 => 'Последняя цифра квадрата - 1',
    };
    echo $res;
} else {
    echo 'Данные не получены';
}
?>
<h2>Задача 4</h2>
<form actions="">
    <p>Введите число:</p>
    <input name="number4">
    <input type="submit" value="Отправить">
</form>
<?php
if(isset($_GET['number4'])){
    $n = $_GET['number4'];
    $last = $n % 10;
    $word = match (true){
        $n >= 11 && $n <= 14 => "лет",
        $last == 1 => "год",
        $last == 2 || $last == 3 || $last == 4 => "года",
        default => "лет",
    };
    echo "Мне $n $word";
} else {
    echo 'Данные не получены';
}
?>
<h2>Задача 5</h2>
<form actions="">
    <p>Введите номер единицы измерения:</p>
    <input name="numberED">
    <p>Введите массу M:</p>
    <input name="number5">
    <input type="submit" value="Отправить">
</form>
<?php
if(isset($_GET['numberED']) && isset($_GET['number5'])){
    $ed = $_GET['numberED'];
    $n = $_GET['number5'];
    $m = $n / 1000000;
    $g = $n / 1000;
    $t = $n * 1000;
    $c = $n * 100;
        $res = match((int)$ed){
        1 => "$n киллограмм",
        2 => "$m киллограмм",
        3 => "$g киллограмм",
        4 => "$t киллограмм",
        5 => "$c киллограмм",
        default => 'Нет такой еденицы измерения',
    };
    echo $res;
} else {
    echo 'Данные не получены';
}
?>
